# NominalDiameter Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConduitSize..::..NominalDiameter Property
ConduitSize Class See Also
---
Nominal diameter
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public double NominalDiameter { get; }
```

Visual Basic
---
```text
Public ReadOnly Property NominalDiameter As Double
	Get
```

Visual C++
---
```text
public:
property double NominalDiameter {
	double get ();
}
```

# See Also
ConduitSize Class
Autodesk.Revit.DB.Electrical Namespace